{
  "welcome": "Bienvenido a VHS",
  "subtitle": "Tu sistema de hándicap abierto",
  "signIn": "Iniciar Sesión",
  "createAccount": "Crear Cuenta",
  "home": "Inicio",
  "courses": "Campos",
  "features": "Características",
  "golfNews": "Noticias de Golf",
  "organizeCollection": "Organiza tu colección",
  "organizeDescription": "Lleva un registro de todas tus películas y programas con categorización simple.",
  "trackProgress": "Realiza un seguimiento del progreso",
  "trackDescription": "Marca lo que has visto y lo que quieres ver.",
  "createWatchlists": "Crea listas de reproducción",
  "watchlistsDescription": "Crea listas personalizadas para diferentes estados de ánimo u ocasiones.",
  "shareRecommendations": "Comparte recomendaciones",
  "shareDescription": "Comparte tus favoritos con amigos y descubre contenido nuevo.",
  "about": "Acerca de",
  "privacy": "Privacidad",
  "terms": "Términos",
  "forgotPassword": {
    "link": "¿Olvidaste tu contraseña?",
    "title": "¿Olvidaste tu contraseña?",
    "subtitle": "No te preocupes, te enviaremos un enlace para restablecerla",
    "emailLabel": "Correo electrónico",
    "sending": "Enviando enlace...",
    "send": "Enviar enlace de restablecimiento",
    "return": "Volver a iniciar sesión",
    "success": "Si existe una cuenta con ese correo electrónico, hemos enviado un enlace para restablecer la contraseña.",
    "error": "No pudimos procesar tu solicitud. Por favor, inténtalo de nuevo."
  },
  "resetPassword": {
    "title": "Restablecer tu contraseña",
    "subtitle": "Crea una nueva contraseña para tu cuenta",
    "newPasswordLabel": "Nueva contraseña",
    "confirmPasswordLabel": "Confirmar nueva contraseña",
    "resetting": "Restableciendo contraseña...",
    "resetButton": "Restablecer contraseña",
    "returnToLogin": "Volver a iniciar sesión",
    "success": "¡Tu contraseña ha sido restablecida con éxito!",
    "invalidLink": "Enlace de restablecimiento inválido. Por favor, solicita un nuevo restablecimiento de contraseña.",
    "passwordsNotMatch": "Las contraseñas no coinciden",
    "resetFailed": "No se pudo restablecer tu contraseña. El enlace puede estar caducado o ser inválido."
  },
  "login": {
    "title": "Iniciar Sesión en VHS",
    "orCreateAccount": "o crear una nueva cuenta",
    "usernameLabel": "Nombre de usuario o Correo electrónico",
    "passwordLabel": "Contraseña",
    "signingIn": "Iniciando sesión...",
    "signIn": "Iniciar Sesión",
    "loginFailed": "Error al iniciar sesión. Por favor, verifica tus credenciales."
  },
  "register": {
    "title": "Crear Cuenta",
    "orSignIn": "o inicia sesión con una cuenta existente",
    "usernameLabel": "Nombre de usuario",
    "emailLabel": "Correo electrónico",
    "passwordLabel": "Contraseña",
    "confirmPasswordLabel": "Confirmar contraseña",
    "creatingAccount": "Creando cuenta...",
    "createAccount": "Crear Cuenta",
    "passwordsNotMatch": "Las contraseñas no coinciden",
    "registrationFailed": "Error al registrarse. Por favor, inténtalo de nuevo."
  },
  "profile": {
    "yourProfile": "Tu Perfil",
    "logout": "Cerrar sesión",
    "username": "Nombre de usuario",
    "email": "Correo electrónico",
    "memberSince": "Miembro desde",
    "editProfile": "Editar perfil",
    "cancel": "Cancelar",
    "saveChanges": "Guardar cambios",
    "accountActions": "Acciones de la cuenta",
    "deleteAccount": "Eliminar cuenta",
    "backToHome": "← Volver al inicio",
    "profileUpdated": "¡Perfil actualizado con éxito!",
    "updateFailed": "Error al actualizar el perfil.",
    "deleteFailed": "Error al eliminar la cuenta.",
    "loading": "Cargando..."
  },
  "terms": {
    "title": "Términos de Servicio",
    "introduction": "Introducción",
    "introText": "Bienvenido a Virtual Handicap System (VHS). Al acceder y utilizar nuestros servicios, aceptas estos Términos de Servicio. Por favor, léelos cuidadosamente.",
    "effectiveDate": "Estos Términos de Servicio están vigentes desde el 1 de enero de 2025.",
    "userAccounts": "Cuentas de Usuario",
    "accountResponsibility": "Eres responsable de mantener la seguridad de tu cuenta y eres totalmente responsable de todas las actividades que ocurran bajo tu cuenta.",
    "accurateInfo": "Debes proporcionar información precisa y completa al crear una cuenta y mantener actualizada la información de tu cuenta.",
    "oneAccount": "Una persona o entidad legal no puede mantener más de una cuenta.",
    "services": "Servicios",
    "servicesText": "VHS proporciona una plataforma para el seguimiento de hándicaps de golf, encontrar campos y conectar con otros golfistas. Nos reservamos el derecho de modificar, suspender o discontinuar el servicio en cualquier momento.",
    "prohibitedActivities": "Actividades Prohibidas",
    "prohibitedText": "No puedes usar nuestros servicios para fines ilegales o para violar leyes en tu jurisdicción.",
    "prohibitedText2": "No puedes publicar o transmitir código dañino o cualquier contenido que sea ilegal, dañino, amenazante, abusivo, acosador, difamatorio o de otra manera objetable.",
    "termination": "Terminación",
    "terminationText": "Podemos terminar o suspender tu cuenta en cualquier momento por cualquier motivo sin previo aviso o responsabilidad.",
    "changes": "Cambios en los Términos",
    "changesText": "Nos reservamos el derecho de modificar estos Términos de Servicio en cualquier momento. Proporcionaremos aviso de cambios significativos publicando un aviso en nuestro sitio web o enviándote un correo electrónico.",
    "contactInfo": "Si tienes alguna pregunta sobre estos Términos, por favor contacta con nosotros en: legal@virtualhandicapsystem.com"
  },
  "about": {
    "title": "Acerca de Virtual Handicap System",
    "ourMission": "Nuestra Misión",
    "missionText": "Virtual Handicap System (VHS) está diseñado para proporcionar a los golfistas una forma simple y efectiva de seguir sus hándicaps, encontrar campos y conectarse con otros jugadores en su área.",
    "missionText2": "Creemos que el golf debe ser accesible para todos, y nuestra plataforma busca hacer que el seguimiento del hándicap sea sencillo y fácil de usar.",
    "features": "Características Principales",
    "feature1": "Cálculo preciso del hándicap",
    "feature2": "Base de datos de campos con información detallada",
    "feature3": "Seguimiento de puntuaciones y estadísticas de rendimiento",
    "feature4": "Diseño adaptado a dispositivos móviles para uso en el campo",
    "contact": "Contáctanos",
    "contactText": "Si tienes alguna pregunta, comentario o sugerencia, no dudes en ponerte en contacto con nuestro equipo:"
  },
  "privacy": {
    "title": "Política de Privacidad",
    "introduction": "Introducción",
    "introText": "En Virtual Handicap System (VHS), nos tomamos tu privacidad en serio. Esta Política de Privacidad explica cómo recopilamos, usamos, divulgamos y protegemos tu información cuando utilizas nuestro servicio.",
    "effectiveDate": "Esta Política de Privacidad está vigente desde el 1 de enero de 2025.",
    "informationCollection": "Información que Recopilamos",
    "personalInfo": "Podemos recopilar información personal que nos proporcionas, incluyendo pero no limitado a:",
    "infoItem1": "Nombre, dirección de correo electrónico y otra información de contacto",
    "infoItem2": "Credenciales de cuenta, como nombres de usuario y contraseñas",
    "infoItem3": "Información de perfil, como hándicap de golf y preferencias",
    "infoItem4": "Puntuaciones de golf y datos de rendimiento",
    "infoItem5": "Preferencias de comunicación",
    "automaticInfo": "También podemos recopilar automáticamente cierta información cuando utilizas nuestro servicio, incluyendo:",
    "autoItem1": "Información del dispositivo (p. ej., tipo de dispositivo, sistema operativo)",
    "autoItem2": "Información de registro (p. ej., dirección IP, tipo de navegador, páginas visitadas)",
    "autoItem3": "Información de ubicación",
    "autoItem4": "Información de uso (p. ej., funciones utilizadas, tiempo empleado)",
    "informationUse": "Cómo Usamos Tu Información",
    "useInfo": "Podemos usar la información que recopilamos para varios propósitos, incluyendo:",
    "useItem1": "Proporcionar y mantener nuestro servicio",
    "useItem2": "Personalizar tu experiencia",
    "useItem3": "Mejorar nuestro servicio",
    "useItem4": "Comunicarnos contigo",
    "useItem5": "Asegurar la seguridad de nuestro servicio",
    "useItem6": "Cumplir con obligaciones legales",
    "informationSharing": "Compartir Información",
    "sharingInfo": "Podemos compartir tu información en las siguientes situaciones:",
    "sharingItem1": "Con proveedores de servicios que nos ayudan a operar nuestro servicio",
    "sharingItem2": "Cuando lo requiera la ley",
    "sharingItem3": "Con tu consentimiento",
    "sharingItem4": "En relación con una transacción comercial",
    "dataSecurity": "Seguridad de Datos",
    "securityInfo": "Tomamos medidas razonables para proteger tu información contra acceso, uso o divulgación no autorizados. Sin embargo, ninguna transmisión de datos por Internet o almacenamiento electrónico es 100% segura.",
    "yourRights": "Tus Derechos de Privacidad",
    "rightsInfo": "Dependiendo de tu ubicación, puedes tener ciertos derechos con respecto a tu información personal, como el derecho a acceder, corregir, eliminar o restringir el procesamiento de tu información.",
    "changes": "Cambios en la Política de Privacidad",
    "changesInfo": "Podemos actualizar nuestra Política de Privacidad de vez en cuando. Te notificaremos sobre cualquier cambio publicando la nueva Política de Privacidad en esta página.",
    "contactInfo": "Si tienes alguna pregunta sobre esta Política de Privacidad, por favor contáctanos en: privacy@virtualhandicapsystem.com"
  }
}
